In [2]:
import pandas as pd 
import sqlite3

In [5]:
cur.close()
conn.close()

NameError: name 'cur' is not defined

In [3]:
conn = sqlite3.connect('budget_tracker.db')
cursor = conn.cursor()
deq= '''DELETE FROM categories WHERE category_name = rent'''
cursor.execute(deq)

OperationalError: no such column: rent

In [23]:
df = pd.read_sql_query("SELECT * FROM categories", conn)
df

   categoryid category_name max_amount
0           1

In [6]:
deq= '''DROP TABLE categories'''
cursor.execute(deq)

In [60]:
conn = sqlite3.connect('budget_tracker.db')
cursor = conn.cursor()

In [19]:
deq= '''DROP TABLE "shopping
"'''
cursor.execute(deq)

In [33]:
df = pd.read_sql_query("SELECT * FROM categories", conn)
df

   categoryid category_name max_amount
0           1

In [20]:
cq = "CREATE TABLE IF NOT EXISTS categories (categoryid INTEGER PRIMARY KEY NOT NULL, category_name TEXT NOT NULL, max_amount FLOAT NOT NULL);"
cursor.execute(cq)

In [61]:
df = pd.read_sql_query("SELECT * FROM categories", conn)
df

   categoryid category_name max_amount
0           1
1           2     groceries      300.0
2           3         shoes       10.0

In [54]:
drq = '''DELETE FROM categories WHERE categoryid = 1'''
cursor.execute(drq)

In [57]:
conn.close()

In [ ]:
df = pd.read_sql_query("SELECT * FROM categories", conn)

In [62]:
df = pd.read_sql_query("SELECT * FROM shoes", conn)
df

   expenseid expense_name  expense_amount
0          1         vans            11.0
1          2      jordans            13.0

In [67]:
sq2 = pd.read_sql_query('SELECT max_amount FROM categories WHERE category_name = "shoes"', conn)
sq2

   max_amount
0        10.0

In [ ]:
type